tiene,has
habían,had
entendido,understood
clase,class
harry,harry
pluma,pen
guerra,war
tan,so
dios,god
le,you
estés,are
marea,tide
mr,mr
el,he
jerry,jerry
puedo,can
coño,cone
marca,brand
debió,must
diferente,different
tras,after
rival,rival
películas,films
ésta,this
piel,skin
intención,intention
show,show
ir,go
os,you
aumentar,increase
país,country
marcador,marker
perfecta,perfect
ben,ben
presión,pressure
pasada,pass
deje,leave
dia,day
dólares,dollars
porque,why
maldita,damn
locura,madness
fotos,photos
hinchar,swell
regresar,return
alto,high
chico,boy
soberanía,sovereignty
aquella,that
hables,speak
poder,power
tomado,taken
verde,green
nube,cloud
playa,beach
mercado,market
nadie,nobody
contrario,contrary
olvidar,forget
jodido,fucking
altavoz,speaker
pobre,poor
oigan,hear
viuda,widow
vivo,alive
verle,see
creí,believed
malas,bad
hubiera,would
perra,dog
muestra,sample
bienvenidos,welcome
calcetines,socks
dónde,where
teléfono,phone
huele,smells
clientes,customers
sería,would
biblioteca,library
paciente,patient
ruido,noise
pasa,happens
diplomático,diplomatic
llamaba,called
prosperar,prosper
nosotros,us
vas,go
emergencia,emergency
sucia,dirty
desastre,disaster
david,david
pensar,think
real,real
humano,human
vuelvas,return
estaría,be
comprar,buy
red,net
sea,be
ray,ray
presa,dam
ganado,won
sexo,sex
oficina,office
recibir,receive
maravilloso,wonderful
dura,hard
estupendo,great
depende,depends
bastardo,bastard
media,half
pedazo,piece
unas,nail
ojalá,hopefully
banda,band
metros,meters
siente,feels
posibilidad,possibility
inevitable,inevitable
batalla,battle
señorita,miss
peor,worst
naval,naval
buenas,good
completamente,completely
sientes,feel
paso,passed
callejón,alley
observación,observation
perfecto,perfect
flor,flower
imposible,impossible
hagan,make
conversión,conversion
trasero,rear
diez,ten
línea,line
c,c
buena,good
adelante,ahead
ee,ee
otras,other
voz,voice
mofeta,skunk
política,politics
ah,ah
nombres,name
maestro,teacher
ablandar,soften
dará,give
encantado,charmed
cállate,quiet
ocho,eight
fuimos,went
fiesta,party
quedo,remain
sentí,felt
cansado,tired
oro,gold
abierta,open
cámara,camera
magnético,magnetic
ratón,mouse
seguro,insurance
como,as
imagino,imagine
guantes,gloves
espacio,space
otros,others
bailando,dancing
herido,injured
oportunidad,opportunity
bobby,bobby
robert,robert
uso,use
encontrado,found
manos,hands
ver,see
afuera,outside
habéis,have
quienes,who
iluminación,lighting
fácil,easy
menor,less
dirección,address
negocios,business
privado,private
lengua,language
informática,computing
mary,mary
tratando,trying
ejército,army
perros,dogs
cosecha,harvest
siempre,always
vienes,viennese
cabra,goat
gana,desire
empieza,starts
deben,should
vengo,come
tuvo,had
dolor,pain
tuve,had
efecto,effect
quedado,left
llegue,arrived
caluroso,hot
organizado,organized
quede,stay
estarás,be
eso,that
hijos,children
tuvimos,had
vergüenza,shame
alegra,happy
gobierno,government
caro,expensive
oscuridad,darkness
investigación,investigation
mike,mike
dinero,money
hacia,toward
dulce,sweet
siéntate,sit
parecer,seem
vistazo,glance
historias,stories
vender,sell
roja,red
gallo,rooster
vayan,go
chicos,boys
contrato,contract
